{"title":"Our Guided Electric powered Bike Tour of Paris","date":"2018-08-10T12:47:00.000Z","excerpt":"<p><img src=\"/3.jpg\" alt=\"\"></p>\n<p>Maggie and Not long ago i did an electric bike tour of the extraordinary and unique metropolis of Paris. It was referred to as the Paris Charms and Secrets Electric Bike Tour, and it ended up being the highlight of our complete Paris trip. Best of all, this tour can be done for most people, because of the effortlessly running e-bikes that make it possible for 50-year-old to cycle with 20-year-old! The e-bike is a fantastic equalizer, but you still get training while being educated and entertained. This video tutorial presents a flavour of the tour.</p>","slug":"Our Guided Electric powered Bike Tour of Paris","categories":["Reviews of E-Bikes"],"updated":"2018-09-08T06:51:42.873Z","content":"<p><img src=\"/3.jpg\" alt=\"\"></p>\n<p>Maggie and Not long ago i did an electric bike tour of the extraordinary and unique metropolis of Paris. It was referred to as the Paris Charms and Secrets Electric Bike Tour, and it ended up being the highlight of our complete Paris trip. Best of all, this tour can be done for most people, because of the effortlessly running e-bikes that make it possible for 50-year-old to cycle with 20-year-old! The e-bike is a fantastic equalizer, but you still get training while being educated and entertained. This video tutorial presents a flavour of the tour.</p>\n<a id=\"more\"></a>\n<p>Our guide was Fabien, an energetic man with impeccable English, and acting skills reminiscent of the French mime Marcel Marceau. Except of lessons he was not a mime - he told us fascinating stories all afternoon. He was unfailingly enthusiastic and cheerful as he confirmed us less travelled spots, and unveiled a few of the secrets of Parisian record to us.</p>\n<p>Though it was a hot day, I hardly ever broke a sweat, and Maggie and I were quickly in a position to keep up with an organization of folks who were many younger than us. Actually, to be honest, we were at the front end of the pack most of the day. After all, we realize bikes! Plus, we can not resist showing that people can still keep our own with people young more than enough to be our children.</p>\n<blockquote><br>Of course we went by the Louvre, and I have to say it felt quite surreal to be cycling at night most iconic museum in the world.<br></blockquote>\n\n<p>A highlight was going to Le Procope, the oldest café in Paris. We stopped for a really great beer, but that had not been the highlight. Fabien had taken us upstairs to show us something few persons possibly know exists: a tiny assortment of mind boggling record, including the last letter that Marie Antoinette wrote to her children on your day she was beheaded. Specialists have confirmed it had been her letter, predicated on the DNA of the tears she shed as she was producing. Then there have been the solid steel desks of Voltaire and Descartes. Yes, their genuine desks, merely standing in a room on the path to the washrooms.</p>\n<p>In the entry to Le Procope there can be an interesting hat behind glass. Works out it belonged to Standard Napoleon Bonaparte. He dined as of this restaurant a long time ago, and happened to haven’t any money on him. So he supplied his hat as surety that he would return to pay out … and the restaurant is still waiting. No doubt burned by this knowledge, they no longer acknowledge hats as surety! On the plus area, if they really wished to, they could sell the hat. Among Napoleon’s hats was marketed recently, and fetched a cost of $2.4 million. At that price, I suspect Le Procope is not shedding any tears over the fact that Napoleon never did return to purchase his meal. From our point of view, it was like looking into the well of record to visit a hat that was actually worn by Napoleon. Judging by the hat, it appears that he previously quite a tiny head.</p>\n","prev":{"title":"Hub Motor vs Crank Drive Electric motor - Which is way better for a E-Bikes?","slug":"Hub Motor vs Crank Drive Electric motor - Which is way better for a E-Bikes"},"next":{"title":"Riding Bosch E-bikes About Zurich Lake","slug":"Riding Bosch E-bikes About Zurich Lake"},"link":"/2018/08/10"}